ci4/app/Controllers/user.php

    public function login()
    {
        helper(['form']);

        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Jika belum submit form
        if (!$email) {
            return view('user/login');
        }

        // Cek user berdasarkan email
        $login = $model->where('useremail', $email)->first();
---
SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1